src/cf/Catalogs/Процессы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Процессы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.БизнесЦели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЭлементПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭлементыПроцесса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательскаяИстория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользовательскиеИстории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Персона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Персоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ЭлементыПроцесса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ЭлементыПроцесса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Старт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскаяИстория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Условие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВариантУсловия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВложенныйПроцесс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Комментарий</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Процессы/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СкрытьРодителей(Команда)
	ПоказатьПредупреждение(, "Не реализовано.");
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовый(ЭлементПроцесса) 
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ЭлементПроцесса", ЭлементПроцесса);
	ПараметрыЗаполнения.Вставить("Владелец", Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы[0].ПравоеЗначение);
	ПараметрыЗаполнения.Вставить("Родитель", Элементы.Список.ТекущаяСтрока);
	
	ПараметрыФормы = Новый Структура;
									 
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ПараметрыЗаполнения);
	
	ОткрытьФорму("Справочник.Процессы.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Создать_Старт(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Старт"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_Завершение(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Завершение"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_ПользовательскаяИстория(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ПользовательскаяИстория"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_Условие(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Условие"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_ВариантУсловия(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ВариантУсловия"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_ВложенныйПроцесс(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.ВложенныйПроцесс"));
КонецПроцедуры

&НаКлиенте
Процедура Создать_Комментарий(Команда)
	СоздатьНовый(ПредопределенноеЗначение("Перечисление.ЭлементыПроцесса.Комментарий"));
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "УстановитьКурсорНаНовыйЭлементПроцесса" Тогда
		Элементы.Список.ТекущаяСтрока = Параметр;
	КонецЕсли;
КонецПроцедуры
